---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.OptionSetName
source: html/b0c49f49-2782-cf5e-4a5a-0d1d87c83d55.htm
---
# Autodesk.Revit.DB.ParameterTypeId.OptionSetName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId OptionSetName { get; }
```